Revit 2026 API

# ViewOutline Property

---

The bounds of the view in paper space (in feet).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BoundingBoxUV Outline { get; }
```
```vb
Public ReadOnly Property Outline As BoundingBoxUV
	Get
```
```cpp
public:
property BoundingBoxUV^ Outline {
	BoundingBoxUV^ get ();
}
```
```fsharp
member Outline : BoundingBoxUV with get
```

#### Property Value

BoundingBoxUV

Returns all zeros for empty views.

#### Reference

View Class

Autodesk.Revit.DB Namespace